uhnp/src/Documents/КвалификацияПоставщика/КвалификацияПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КвалификацияПоставщика</name>
  <basedOn>Document.ОповещениеАккредитованныхПоставщиковОТоргах</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.УчастникиКвалификации</registerRecords>
  <registerRecords>InformationRegister.УчастникиКвалифицированныеПоЛоту</registerRecords>
  <attributes>
    <name>АнкетаПоставщика</name>
    <type>
      <types>CatalogRef.АнкетыПоставщиков</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаСогласование</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументАккредитации</name>
    <type>
      <types>DocumentRef.АккредитацияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказОНазначенииКомиссии</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииЗакупочнойКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПоДокументу</name>
    <type>
      <types>EnumRef.ВидыРешенийПоДокументуКвалификации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛот</name>
    <type>
      <types>CatalogRef.Лоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаПодачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребованияЛота</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМножества</name>
      <type>
        <types>DefinedType.ТипЗначенияКритерияОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненИзАккредитации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийУчастника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеПоложительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКомиссии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеАккредитации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьКомиссияПоКвалификации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиЧленовКомиссии</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ИсторияОповещенияВнешнегоПользователя/ИсторияОповещенияВнешнегоПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияОповещенияВнешнегоПользователя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВерсияДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрочитаноПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОповещений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оповещение</name>
    <type>
      <types>CatalogRef.ВидыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыРешенийПоДокументуКвалификации/ВидыРешенийПоДокументуКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРешенийПоДокументуКвалификации</name>
  <enumValues>
    <name>РешениеНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПоложительноеРешение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияАккредитацииПоставщиков/СостоянияАккредитацииПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияАккредитацииПоставщиков</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Аккредитован</name>
  </enumValues>
  <enumValues>
    <name>НеАккредитован</name>
  </enumValues>
  <enumValues>
    <name>ЛишенАккредитации</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УстановкаТребованийКвалификацииКНоменклатуреПоставщиков/УстановкаТребованийКвалификацииКНоменклатуреПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТребованийКвалификацииКНоменклатуреПоставщиков</name>
  <registerRecords>InformationRegister.ТребованияКвалификацииКНоменклатуреПоставщиков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.КатегорииЗакупок</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/АккредитацияПоставщика/АккредитацияПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АккредитацияПоставщика</name>
  <basedOn>Catalog.АнкетыПоставщиков</basedOn>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <registerRecords>InformationRegister.НоменклатураАккредитованыхПоставщиков</registerRecords>
  <registerRecords>InformationRegister.СостоянияАккредитованныхПоставщиков</registerRecords>
  <registerRecords>InformationRegister.АккредитованыеПоставщики</registerRecords>
  <attributes>
    <name>АнкетаПоставщика</name>
    <type>
      <types>CatalogRef.АнкетыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаАккредитации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаАккредитации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПоДокументу</name>
    <type>
      <types>EnumRef.ВидыРешенийПоДокументуАккредитации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПовторнаяАккредитация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяАккредитация</name>
    <type>
      <types>DocumentRef.АккредитацияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаСогласование</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереаккредитации</name>
    <type>
      <types>EnumRef.ПричинаПереаккредитации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоставляемыхТоваровРаботУслуг</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбщиеТребования</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМножества</name>
      <type>
        <types>DefinedType.ТипЗначенияКритерияОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийУчастника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеПоложительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКомиссии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНоменклатураПоставщика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомиссияПоАккредитации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварныеКатегории</name>
    <attributes>
      <name>ТоварнаяКатегория</name>
      <type>
        <types>CatalogRef.КатегорииЗакупок</types>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/КвалификацияПоставщика/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаОсновныхСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ЭтоВнешнийПользователь =
		ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя();
	#Область УХ_УниверсальныеПроцессыСогласование
	АккредитацияПоставщиковУХ.ИнициализироватьПодсистемуСогласованияПоВнешнемуПоставщику(
		ЭтаФорма);
	#КонецОбласти
	СтараяЗакупка = Объект.ЗакупочнаяПроцедура;
	УстановитьПредставлениеСтатусаАккредитации();
	УстановитьОформлениеФормыВнешнегоПоставщика();
	УстановитьОформлениеФормы();
	Если НЕ ЭтоВнешнийПользователь Тогда	
		МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);        
	КонецЕсли;      

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	#Область УХ_УниверсальныеПроцессыСогласование
		Если ИмяСобытия = "ОбъектСогласован" ИЛИ ИмяСобытия = "ОбъектОтклонен" ИЛИ ИмяСобытия = "МаршрутИнициализирован" ИЛИ ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
			ОпределитьСостояниеОбъекта();
			УстановитьОформлениеФормы();
		КонецЕсли;
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Отказ И НЕ ЭтоВнешнийПользователь
			И Объект.РешениеПоДокументу = ПредопределенноеЗначение(
					"Перечисление.ВидыРешенийПоДокументуКвалификации.ПоложительноеРешение") Тогда
		мОшибок =
			АккредитацияПоставщиковКлиентУХ.ПроверитьУстановленностьРешенийПоСтрокам(
				Объект, 
				"ТребованияЛота", 
				"РешениеПоложительно");
		ЦентрализованныеЗакупкиКлиентСерверУХ.СообщитьПользователюИзМассива(
			мОшибок);
		Если ПустаяСтрока(Объект.ОбоснованиеРешения) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не заполнено решение по документу.'");
			Сообщение.Поле = "Объект.ОбоснованиеРешения";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьКвалификацииУчастников", Объект.ЗакупочнаяПроцедура, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти


#Область ОбработкаСобытийЭлементовФормы


&НаКлиенте
Процедура ОповеститьПоставщикаОРешении(Команда)
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо записать документ перед отправкой оповещения.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;   
	Если НЕ ЗначениеЗаполнено(Объект.АнкетаПоставщика)  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо заполнить участника'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	АдресЭП = ПолучитьАдресПоПоставщику();  
	Если СокрЛП(АдресЭП) = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо заполнить адрес электронной почты участника.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.РешениеПоДокументу)  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо принять решение по аккредитации.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Документ",Объект.Ссылка); 
	ПараметрыФормы.Вставить("АдресЭП",АдресЭП);
	ПараметрыФормы.Вставить("Пользователь",ОбщегоНазначенияУХ.ТекущийПользователь());
	ОткрытьФорму("РегистрСведений.ИсторияОповещенияВнешнегоПользователя.Форма.ФормаОтправки",ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресПоПоставщику()
	
	Если Не ЗначениеЗаполнено(Объект.АнкетаПоставщика) Тогда 
		Возврат "";
	ИначеЕсли ТипЗНЧ(Объект.АнкетаПоставщика) = Тип("СправочникСсылка.Контрагенты") Тогда     
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.АнкетаПоставщика,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Иначе
		Возврат ОбщегоНазначенияУХ.ЗначениеРеквизитаОбъекта(Объект.АнкетаПоставщика,"АдресЭП")
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 

КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ОбработатьИзменениеКлючевыхРеквизитовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗакупочнаяПроцедураПриИзменении(Элемент)
	Если СтараяЗакупка <> Объект.ЗакупочнаяПроцедура Тогда
		ЗакупочнаяПроцедураПриИзмененииНаСервере();
		СтараяЗакупка = Объект.ЗакупочнаяПроцедура;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РешениеПоДокументуПриИзменении(Элемент)
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)

	ОтправитьНаПроверку(Объект.АнкетаПоставщика,Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаПроверку(АнкетаПоставщика,Документ)
	
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо записать документ перед отправкой оповещения.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;      
	
	Ответственный = Документы.УстановкаТребованийКвалификацииКНоменклатуреПоставщиков.ПолучитьОтветственногоТребованийКвалификации(Объект.Организация,Объект.Дата); 
	Если Ответственный <> Неопределено Тогда
			АккредитацияПоставщиковУХ.ОтправитьНаПроверку(Ответственный,Документ);
	КонецЕсли;	
	Объект.ДатаОтправкиНаСогласование = ТекущаяДатаСеанса();

КонецПроцедуры

&НаКлиенте
Процедура ТребованияЛотаЗначениеМножестваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.ОграничениеТипа.СодержитТип(Тип("Строка")) Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.ТребованияЛота.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ЗаголовокТекста = Строка(ТекДанные.Критерий);
		Иначе
			ЗаголовокТекста = "";
		КонецЕсли;
		АккредитацияПоставщиковКлиентУХ.ТабличнаяЧастьОткрытьРедакторМногострочногоТекста(ЭтаФорма, "Объект.ТребованияЛота", "ТребованияЛота", "ЗначениеМножества", ЗаголовокТекста);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТребованияЛотаРедактироватьТекст(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяРеквизитаПоИмениЭлемента = СтрЗаменить(Элемент.Имя, "ТребованияЛота", "");
	АккредитацияПоставщиковКлиентУХ.ТабличнаяЧастьОткрытьРедакторМногострочногоТекста(ЭтаФорма, "Объект.ТребованияЛота", "ТребованияЛота", ИмяРеквизитаПоИмениЭлемента, Элемент.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ТребованияЛотаПередНачаломИзменения(Элемент, Отказ)
	ТекДанные = Элементы.ТребованияЛота.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Критерий) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаЗначениеМножества = Элементы.ТребованияЛотаЗначениеМножества;
	
	ОписаниеТипаКритерия = ВыборОбъектовВызовСервераУХ.ПолучитьОписаниеТипаКритерия(ТекДанные.Критерий);
	КолонкаЗначениеМножества.ОграничениеТипа = ОписаниеТипаКритерия;
	ТекДанные.ЗначениеМножества = ОписаниеТипаКритерия.ПривестиЗначение(ТекДанные.ЗначениеМножества);
	
	флРедактированиеСтроки = ОписаниеТипаКритерия.СодержитТип(Тип("Строка"));
	флВыборЗначения = ОписаниеТипаКритерия.СодержитТип(Тип("СправочникСсылка.ЗначенияПеречислимыхКритериев"));
	
	КолонкаЗначениеМножества.МногострочныйРежим = флРедактированиеСтроки;
	КолонкаЗначениеМножества.КнопкаВыбора = флРедактированиеСтроки ИЛИ флВыборЗначения;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТребованиямиИзЛота(Команда)
	ОбработкаПодтвержденияОчисткиТребований =
		Новый ОписаниеОповещения(
			"ОбработатьПодтверждениеОчисткиТребований", 
			ЭтаФорма);
	ПоказатьВопрос(ОбработкаПодтвержденияОчисткиТребований,
		НСтр("ru = 'Требования будут перезаполнены. Вы уверены?'"),
		РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодтверждениеОчисткиТребований(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТребованиямиИзЛотаНаСервере();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыНаКлиенте
 // ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом


#КонецОбласти


#Область СлужебныеПроцедурыНаСервере


&НаСервере
Процедура УстановитьОформлениеФормы()
	ТекСтатус = РеквизитСтатусОбъекта(ЭтаФорма);
	флЧерновик = (ТекСтатус = Перечисления.СостоянияСогласования.Черновик) ИЛИ НЕ ЗначениеЗаполнено(ТекСтатус);
	флУтвержденаИлиОтменена = (ТекСтатус = Перечисления.СостоянияСогласования.Утверждена) ИЛИ
		(ТекСтатус = Перечисления.СостоянияСогласования.Отклонена);
	флЕстьРешениеПоДокументу = флУтвержденаИлиОтменена И
		(Объект.РешениеПоДокументу <> Перечисления.ВидыРешенийПоДокументуКвалификации.РешениеНеПринято);
			
	Элементы.ФормаОповеститьПоставщикаОРешении.Видимость = НЕ ЭтоВнешнийПользователь И флЕстьРешениеПоДокументу И Объект.Проведен;
	
	Элементы.ДокументАккредитации.Видимость = ЗначениеЗаполнено(Объект.ДокументАккредитации);
КонецПроцедуры

// Вызывается один раз при создании формы.
// Устанавливает свойства элементов формы в зависимости
// от того обыйный или внешний пользователь ее открыл.
//
&НаСервере
Процедура УстановитьОформлениеФормыВнешнегоПоставщика() Экспорт
	ТекСтатус = РеквизитСтатусОбъекта(ЭтаФорма);
	флЧерновик = (ТекСтатус = Перечисления.СостоянияСогласования.Черновик)
				ИЛИ НЕ ЗначениеЗаполнено(ТекСтатус);
	
	АккредитацияПоставщиковУХ.УстановитьОбщееОформлениеФормыЭлементаВнешнегоПоставщика(
			ЭтаФорма, флЧерновик, Истина, Истина, Ложь);
			
	Элементы.ЗакупочнаяПроцедура.КнопкаОткрытия = НЕ ЭтоВнешнийПользователь;		
	Элементы.ТребованияЛотаРешениеПоложительно.Видимость = НЕ ЭтоВнешнийПользователь;
	Элементы.ТребованияЛотаКомментарийКомиссии.Видимость = НЕ ЭтоВнешнийПользователь;
	Элементы.ПриказОНазначенииКомиссии.Видимость = НЕ ЭтоВнешнийПользователь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПовторнуюАккредитацию()
	Если ЗначениеЗаполнено(Объект.АнкетаПоставщика) И ЗначениеЗаполнено(Объект.Организация) Тогда
		Отбор_ = Новый Соответствие;
		Отбор_.Вставить("Ссылка", Новый Структура("Значение,ВидСравнения", Объект.Ссылка, "<>"));
		ПредыдущаяАккредитация_ = АккредитацияПоставщиковУХ.ПолучитьДокументыАккредитации(
				"АккредитацияПоставщика", 
			Объект.Организация, 
			Объект.АнкетаПоставщика, 
			АккредитацияПоставщиковУХ.ПолучитьДатуПоискаАккредитованныхПоставщиков(
				Объект.ЗакупочнаяПроцедура), 
			Отбор_);
		Если ЗначениеЗаполнено(ПредыдущаяАккредитация_) Тогда
			Объект.ДокументАккредитации = ПредыдущаяАккредитация_;
		Иначе
			Объект.ДокументАккредитации = Документы.АккредитацияПоставщика.ПустаяСсылка();
		КонецЕсли;
	Иначе
		Объект.ДокументАккредитации = Документы.АккредитацияПоставщика.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеКлючевыхРеквизитовНаСервере()
	ЗаполнитьПовторнуюАккредитацию();
	УстановитьПредставлениеСтатусаАккредитации();
	ЗаполнитьТребованиямиИзЛотаНаСервере();
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребованиямиИзЛотаНаСервере()
	мНоменклатуры =
	ЦентрализованныеЗакупкиУХ.ПолучитьМассивНоменклатурыИГруппЗакупки(
	Объект.ЗакупочнаяПроцедура);			
	ТребованияПоНоменклатуре = 
	АккредитацияПоставщиковУХ.ПолучитьВсеТребованияПоНоменклатуре(
	Объект.Дата,
	Объект.Организация,
	мНоменклатуры);
	Объект.ТребованияЛота.Загрузить(
	АккредитацияПоставщиковУХ.ОбъединитьТребованияКПоставщикам(
	Объект.ЗакупочнаяПроцедура.ТребованияКПоставщикам.Выгрузить(),
	ТребованияПоНоменклатуре));
	ТЧОтветов = АккредитацияПоставщиковУХ.ПолучитьТребованияЗакупкиДляПоставщика(Объект.ЗакупочнаяПроцедура,Объект.АнкетаПоставщика,Объект.ТребованияЛота.Выгрузить());
	Для Каждого Строка ИЗ Объект.ТребованияЛота Цикл
		Для Каждого Ответ ИЗ ТЧОтветов Цикл
			Если Ответ.Критерий = Строка.Критерий Тогда
				Строка.ЗначениеМножества = Ответ.ЗначениеМножества;
				Строка.КомментарийКомиссии = Ответ.КомментарийКомиссии;
				Строка.КомментарийУчастника = Ответ.КомментарийУчастника; 
				Строка.РешениеПоложительно = Ответ.РешениеПоложительно;  
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеСтатусаАккредитации()
	Если НЕ ЗначениеЗаполнено(Объект.ЗакупочнаяПроцедура) Тогда
		Элементы.СостояниеАккредитации.Заголовок =
			НСтр("ru='Укажите закупочную процедуру для определения состояния аккредитации!'");
		Элементы.СостояниеАккредитации.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		Аккредитован = Ложь;
	Иначе
		ДанныеАккредитации = 
			АккредитацияПоставщиковУХ.УстановитьПредставлениеСтатусаАккредитацииНаФорме(
				ЭтаФорма,
				Объект.Организация,
				Объект.АнкетаПоставщика,
				АккредитацияПоставщиковУХ.ПолучитьДатуПоискаАккредитованныхПоставщиков(
					Объект.ЗакупочнаяПроцедура));
		Аккредитован = (ДанныеАккредитации <> Неопределено)
			И (ДанныеАккредитации.Состояние = 
				Перечисления.СостоянияАккредитацииПоставщиков.Аккредитован);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗакупочнаяПроцедураПриИзмененииНаСервере()
	Объект.Организация = Объект.ЗакупочнаяПроцедура.ОрганизаторЗакупки;
	ОбработатьИзменениеКлючевыхРеквизитовНаСервере();
КонецПроцедуры

		
#КонецОбласти


#Область ПереопределеноУниверсальныеПроцессыСогласование


&НаСервере
Процедура ОпределитьСостояниеОбъекта()
	Если ЭтоВнешнийПользователь Тогда
		СостояниеЗаявки = УправлениеПроцессамиСогласованияУХ.ВернутьТекущееСостояние(Объект.Ссылка);
		СтатусОбъекта = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Объект.Ссылка);
	Иначе
		ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область УХ_УниверсальныеПроцессыСогласование


&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние,,,ЭтаФорма);
	
КонецФункции

// Выводит на форму панель согасования и устанавливает обработчики событий
// для элементов панели.
&НаСервере
Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта() Экспорт
	МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(Элементы, ЭтаФорма);
	ЭтаФорма.Команды["ПринятьКСогласованию"].Действие	 = "ПринятьКСогласованию_Подключаемый";
	ЭтаФорма.Команды["ИсторияСогласования"].Действие	 = "ИсторияСогласования_Подключаемый";
	ЭтаФорма.Команды["СогласоватьДокумент"].Действие	 = "СогласоватьДокумент_Подключаемый";
	ЭтаФорма.Команды["ОтменитьСогласование"].Действие	 = "ОтменитьСогласование_Подключаемый";
	ЭтаФорма.Команды["МаршрутСогласования"].Действие	 = "МаршрутСогласования_Подключаемый";
	ЭтаФорма.Команды["ВложенияСогласования"].Действие	 = "ВложенияСогласования_Подключаемый";
	ОпределитьСостояниеОбъекта();
	ЭлементСтатусОбъекта = Элементы.Найти("СтатусОбъекта");
	Если ЭлементСтатусОбъекта <> Неопределено Тогда
		Если ЭлементСтатусОбъекта.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементСтатусОбъекта.УстановитьДействие("ОбработкаВыбора", "СтатусОбъектаОбработкаВыбора"); 
		Иначе
			// В прочих случаях не устанавливаем обработчик выбора.
		КонецЕсли;
	Иначе
		// Нет элемента Статус объекта.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции


#КонецОбласти
